<template>
  <card-container :data="data">
    <template #svg>
      <svg
        t="1751196420864"
        class="icon"
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="1684"
        width="42"
        height="42"
      >
        <path
          d="M29.924473 1024l211.821065 0L241.745538 67.153121c0-29.216699-14.608349-58.433397-36.520873-58.433397L66.445346 8.719724c-21.912524 0-36.520873 29.216699-36.520873 58.433397L29.924473 1024 29.924473 1024zM146.791268 929.04573 117.574569 929.04573l0-138.779318L146.791268 790.266411 146.791268 929.04573 146.791268 929.04573zM59.141172 213.236614c0-21.912524 14.608349-43.825048 29.216699-43.825048l80.345921 0c14.608349 0 29.216699 21.912524 29.216699 43.825048l0 73.041746c0 21.912524-14.608349 43.825048-29.216699 43.825048L88.35787 330.103408C73.749521 330.103408 59.141172 315.495059 59.141172 286.27836L59.141172 213.236614 59.141172 213.236614zM59.141172 213.236614"
          fill="#65BDB8"
          p-id="1685"
        />
        <path
          d="M314.787284 1024l211.821065 0L526.608349 67.153121c0-29.216699-14.608349-58.433397-36.520873-58.433397L351.308158 8.719724c-21.912524 0-36.520873 29.216699-36.520873 58.433397L314.787284 1024 314.787284 1024 314.787284 1024zM395.133206 929.04573 373.220682 929.04573l0-138.779318 21.912524 0L395.133206 929.04573 395.133206 929.04573zM468.174952 929.04573 438.958254 929.04573l0-138.779318 29.216699 0L468.174952 929.04573 468.174952 929.04573zM351.308158 213.236614c0-21.912524 14.608349-43.825048 29.216699-43.825048l80.345921 0c14.608349 0 29.216699 21.912524 29.216699 43.825048l0 73.041746c0 21.912524-14.608349 43.825048-29.216699 43.825048L380.524856 330.103408c-14.608349 0-29.216699-21.912524-29.216699-43.825048L351.308158 213.236614 351.308158 213.236614zM351.308158 213.236614"
          fill="#65BDB8"
          p-id="1686"
        />
        <path
          d="M818.775335 1024l204.51689-58.433397L745.733589 45.240597C738.429414 16.023898 716.51689-5.888626 694.604366 1.415549L563.129223 45.240597C548.520873 45.240597 533.912524 74.457296 548.520873 110.978169L818.775335 1024 818.775335 1024 818.775335 1024zM869.904558 907.133206l-21.912524 7.304175-36.520873-131.475144 21.912524-7.304175L869.904558 907.133206 869.904558 907.133206zM942.946304 892.524856l-29.216699 7.304175L877.208732 768.353887l29.216699-7.304175L942.946304 892.524856 942.946304 892.524856zM621.56262 235.149138c-7.304175-21.912524 0-43.825048 14.608349-51.129223l80.345921-21.912524c14.608349-7.304175 36.520873 7.304175 43.825048 36.520873l21.912524 73.041746c7.304175 21.912524 0 43.825048-14.608349 51.129223L687.300192 344.711758C672.691842 344.711758 650.779318 330.103408 643.475144 308.190884L621.56262 235.149138 621.56262 235.149138zM621.56262 235.149138"
          fill="#65BDB8"
          p-id="1687"
        />
      </svg>
      <h1>Doc</h1>
    </template>
    <template #describe>
      <p>
        文档是一种对软件系统的书面描述；文档应当精确地描述软件系统；软件文档是软件工程师之间用作沟通交流的一种方式；文档的类型有很种，包括软件需求文档，设计文档，测试文档，用户手册等；文档的呈现方式有很种，可以是传统的书面文字形式或图表形式。
      </p>
    </template>
    <template #content>
      <el-card id="part1" shadow="hover">
        <h2>Life</h2>
        <p>摄影系列</p>
        <ul>
          <li>
            iso:
            <ul>
              <li>户外晴天或阴天 100~200</li>
              <li>树荫下 400~800</li>
              <li>室内照明 800~1600</li>
              <li>房间 3200</li>
            </ul>
          </li>
          <li>
            光圈（控制景深）
            <ul>
              <li>光圈越大，背景越虚化</li>
              <li>光圈越小，背景越清晰</li>
              <li>F8 F11 F16 小光圈 拍风景，合影等</li>
            </ul>
          </li>
          <li>
            快门 S
            <ul>
              <li>
                越高，拍运动的物体时，拍到的静止画面越精准，快门越低，可以拍到更加模糊的照片，也有进光量
              </li>
            </ul>
          </li>
          <li>
            拨轮
            <ul>
              <li>M（手动模式）：新手进阶用的模式</li>
              <li>S（快门优先）：需要把感光度iso调到自动，这样曝光才会正常</li>
              <li>A（光圈优先）：绝大多数情况下用光圈优先</li>
              <li>P（程序自动）：感光度iso调到自动，只需要按快门</li>
              <li>Auto（傻瓜模式）</li>
            </ul>
          </li>
          <li>
            对焦模式
            <ul>
              <li>手动对焦要用对焦环来控制</li>
              <li>
                AF-S 单次对焦
                <ul>
                  <li>AF-C 连续对焦</li>
                  <li>AF-A 无法确定对焦，介于单次和连续之间</li>
                  <li>DMF 对焦后还能用对焦环手动对焦，做校正</li>
                </ul>
              </li>
            </ul>
          </li>
          <li>
            对焦区域
            <ul>
              <li>广域：随机对焦点，拍运动物体用广域或者区</li>
              <li>区：拍运动物体</li>
              <li>中间：很少选，旅游时让其他旅客帮你拍照时</li>
              <li>自由点：使用最多，可以使用大中小</li>
              <li>扩展自由点：优先对焦内框，对焦不上后启动外框对焦</li>
            </ul>
          </li>
          <li>学摄像先用多重曝光，其他偏向手动，是让画面整体亮度是协调的</li>
          <li>
            磨皮
            <ul>
              <li>
                反向质感磨皮
                <ul>
                  <li>ctrl + j 复制一层</li>
                  <li>ctrl + i 反向 ，模式改为亮光</li>
                  <li>
                    滤镜 => 其他 => 高反差保留 =>
                    半径66.8（自己控制，让皮肤纹理过渡平滑）
                  </li>
                  <li>
                    滤镜 => 模糊 => 高斯模糊 => 半径设置到刚好看得见皮肤的纹理
                    5~8
                  </li>
                  <li>
                    按住
                    alt键添加一个黑色蒙版，用白色画笔涂需要磨皮的地方，透明度都可以改下，根据照片实际调整
                  </li>
                </ul>
              </li>
              <li>
                高低频
                <ul>
                  <li>
                    画笔修复工具去污点，ctrl + j
                    复制两个层，一个命名高频，另一个命名低频，顺序上高下低，先关闭高频
                    <ul>
                      <li>
                        （低频图层）滤镜 => 模糊 => 高斯模糊 =>
                        开到让皮肤纹理消失
                      </li>
                      <li>
                        （高频图层）图像 => 应用图像 => 图层选低频图层 =>
                        混合模式改成 减去 =>缩放2，补偿128，模式改成线性光
                      </li>
                      <li>
                        （低频图层）框选需要磨皮的范围，shift +F6 羽化20， 滤镜
                        => 模糊 => 高斯模糊 20
                      </li>
                    </ul>
                  </li>
                </ul>
              </li>
            </ul>
          </li>
          <li>
            美白
            <ul>
              <li>
                阳光底下
                <ul>
                  <li>新建一个纯色图层，颜色改为纯白色，混合模式改成 柔光</li>
                  <li>
                    双击颜色图层，打开图层样式，按住alt
                    将下一个图层的暗部阴影滑块拖到最右，确定
                  </li>
                  <li>
                    创建一个色相饱和度，点手图标，吸附饱和度最高的区域，降低饱和度，提高一点明度
                  </li>
                  <li>
                    把图层ctrl + G
                    建组，给组添加一个蒙版，用画笔把除了肤色的区域恢复
                  </li>
                  <li>看图片状态，可以双击蒙版降低浓度</li>
                </ul>
              </li>
              <li>
                曝光不足下
                <ul>
                  <li>色阶，把高光部分往暗部拉，到正常曝光状态</li>
                  <li>再创建色阶，中间调滑块往阴影部分拉，让皮肤白皙</li>
                  <li>
                    图层变得彩色噪点，双击色阶图层，按住alt
                    挪动阴影滑块到差不多的位置
                  </li>
                  <li>将色阶12合并组</li>
                </ul>
              </li>
              <li>
                逆光下照片
                <ul>
                  <li>
                    曲线，用三个吸管，黑场，灰场，白场，使用白场工具吸取肤色任意位置，让肤色提亮
                  </li>
                  <li>
                    双击曲线蒙版，双击图层样式，按住alt
                    滑动下一图层的阴影滑块到差不多的值
                  </li>
                  <li>把非人物区域蒙版画笔恢复</li>
                  <li>复制曲线，降低不透明度，让更自然</li>
                  <li>创建一个颜色查找，套个lut，改不透明度让画面更好看</li>
                </ul>
              </li>
              <li>
                光线不足
                <ul>
                  <li>ctrl + shift + a 进入 Camera rwa滤镜</li>
                  <li>把高光纸减到最低，打开曲线</li>
                  <li>
                    拖动右上角的点往左拖动，观察直方图，当高光警告亮起来的时候停止
                  </li>
                  <li>打开混色器，调整</li>
                  <li>校准，增加饱和度</li>
                </ul>
              </li>
              <li>
                技巧
                <ul>
                  <li>创建一个可选颜色</li>
                  <li>把红色的黑色减去100</li>
                  <li>把黄色的黑色减去100</li>
                  <li>蒙版画笔，把嘴唇的色彩还原</li>
                </ul>
              </li>
            </ul>
          </li>
          <li>
            微信朋友圈最短边
            <ul>
              <li>1080x1620 2：3</li>
              <li>1080x1440 3：4</li>
              <li>1080x1920 9：16</li>
              <li>1080x1080 1：1</li>
            </ul>
          </li>
          <li>
            调色LR
            <ul>
              <li>镜头校正：对应的相机自动会识别</li>
              <li>变换：用自动就行，校正拍摄时的畸变</li>
              <li>
                基本：1用吸管工具吸取图片中本是白色的物体来自动调整白平衡。如果是白色的偏蓝或偏黄就白平衡不准
                <ul>
                  <li>也可以手动用色温调整白平衡，左右校正</li>
                  <li>画面暗就用曝光度，看直方图，让大部分像素偏中间即可</li>
                  <li>高光调整细节</li>
                  <li>阴影调整暗部细节</li>
                  <li>画面灰可以调整对比度</li>
                  <li>偏好里面参数都可以适当加一点</li>
                </ul>
              </li>
              <li>
                二级调色
                <ul>
                  <li>
                    校准：红色色相往右调，绿色色相往右调，蓝色色相往左调。
                  </li>
                  <li>
                    HSL/颜色：单独对每个颜色做调整，调整饱和度和明亮度，让主题更突出，其他颜色降低
                  </li>
                  <li>颜色分级：定调，调整阴影</li>
                  <li>
                    色调曲线：让画面失去纯黑纯白部分，曲线亮部暗部拉下，减25左右
                  </li>
                </ul>
              </li>
              <li>
                突出主体：添加蒙版，选择主体，在蒙版上右键反转蒙版，除去主体进行的调整
                <ul>
                  <li>降曝光</li>
                  <li>降饱和度</li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </el-card>
      <el-card id="part2" shadow="hover">
        <h2>Work</h2>
        <p>待开发 ...</p>
      </el-card>
      <el-card id="part3" shadow="hover">
        <h2>Subtitle</h2>
        <p>待开发 ...</p>
      </el-card>
    </template>
  </card-container>
</template>

<script setup lang="ts" name="DocumentPage">
import { ref } from "vue";

const data = ref([
  { id: 1, h2: "Life" },
  { id: 2, h2: "Work" },
  { id: 3, h2: "Subtitle" },
]);
</script>

<style scoped lang="scss"></style>
